/*
<< >> & | ^ ~
移位运算符
i<<j: 将i左移j位，在右边补0；若没有发生溢出，相当于乘以2的j次幂
i>>j：将i右移j位，若i为无符号数/非负数，则左边补0；若i为负数，则它的行为不定，有的补0，有的补1
------------------------------
按位运算符
~ & | ^
注意：
1. a ^ 0 = a
2. a ^ a = 0
3. a ^ b = b ^ a
4. a ^ ( b ^ c ) = ( a ^ b ) ^ c
*/
#include<stdio.h>
int main(void) {
	short s = -13;
	// printf("s << 2 = %d",s << 2); // 52
	// printf("s >> 2 = %d",s >> 2); // 3
	// printf("s << 2 = %d", s << 2); // -52
	s = s >> 2;
	// printf("s >> 2 = %d", s >> 2); // -4
	// ff f3 ->1111 1111 1111 0011 补码
	// ff fc ->1111 1111 1111 1100 补码 
	// 1.如何判断一个数是不是奇数？
	// n & 0x1
	// 2.如何判断一个整数是不是2的幂？
	// 只有一个1
	// (n & n - 1) == 0
	// 3.给定一个不为0的整数，找出值为1这权重最低的位
	// ((n^n-1)+1)>>1
	// 正解：n & (-n)
	// 4.给定一个整数数组，里面的数均成对，只有一个数例外，请找出这个数
	// n = 0; n ^ arr[i] a ^ 0 = a a ^ a = 0
	return 0;
}