/*
一、指针的算术运算
当指针指向数组元素时，可以通过指针的算术运算访问数组的其他元素 指针加上一个数 指针减去一个数 两个指针相减
指针的算术运算是以元素大小为单位，而不是以字节为单位
二、指针处理数组
*p++的组合 = *(p++)表达式的值是*p，副作用p自增
(*p)++的组合 = (*p)++表达式的值是*p，副作用*p指向的对象自增
*++p的组合 = *(++p)表达式的值是*(p+1) 副作用是p自增
++*p的组合 = ++(*p)表达式的值是*p + 1 副作用是*p自增
*/
#include<stdio.h>
int main(void) {
	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
	int* p = &arr[2];
	int* q = p + 3;
	p += 4;// 地址发生了变化
	printf("*p = %d, *q = %d\n", *p, *q);// *p = 7, *q = 6
	int sum = 0;
	// &arr[10]只会计算arr[10]的地址，不会访问arr[10]，不会发生数组越界
	for (int* o = &arr[0]; o < &arr[10]; o++)
	{
		sum += *o;
	}

	printf("sum = %d\n", sum);// 55
	return 0;
}